[
  {
    "id": 1,
    "senderId": 1,
    "text": "Welcome, everyone. Let’s review our quarterly goals and discuss any pressing issues. I appreciate everyone making time for this meeting. Please feel free to bring up any concerns as we go through the agenda.",
    "direction": "received",
    "timestamp": "Oct 1, 2023, 10:00 AM"
  },
  {
    "id": 2,
    "senderId": 4,
    "text": "Financials are strong, but we should monitor cash flow closely, especially with the upcoming investments. I suggest we set up a bi-weekly review to track our liquidity and ensure we’re prepared for any unexpected expenses.",
    "direction": "sent",
    "timestamp": "Oct 1, 2023, 10:03 AM"
  },
  {
    "id": 3,
    "senderId": 3,
    "text": "The tech team is on track with the new platform launch. We’ve completed the initial testing phase and are now focused on scalability and security improvements. We’re also preparing documentation for the support team and will need input from QA by next week.",
    "direction": "received",
    "timestamp": "Oct 1, 2023, 10:06 AM"
  },
  {
    "id": 4,
    "senderId": 2,
    "text": "Operations are running smoothly, but supply chain risks remain. We’re working with new suppliers to mitigate these risks and ensure timely delivery for the next quarter. I’ll provide a detailed update on our contingency plans in the next meeting.",
    "direction": "sent",
    "timestamp": "Oct 1, 2023, 10:09 AM"
  },
  {
    "id": 5,
    "senderId": 5,
    "text": "Marketing is ramping up for the product launch next month. The team is preparing a multi-channel campaign and will need input from product and tech for messaging. We’re also coordinating with PR to maximize our reach and will share the draft plan by Friday.",
    "direction": "received",
    "timestamp": "Oct 1, 2023, 10:12 AM"
  },
  {
    "id": 6,
    "senderId": 1,
    "text": "Excellent updates. Let’s align on next steps and responsibilities for each department. Please make sure your teams are aware of the deadlines and dependencies. If there are any blockers, let’s address them now.",
    "direction": "sent",
    "timestamp": "Oct 1, 2023, 10:15 AM"
  },
  {
    "id": 7,
    "senderId": 4,
    "text": "I recommend we review our budget allocations for R&D to support the tech team’s needs. I’ll circulate a revised budget proposal for review before our next meeting. Also, are there any anticipated resource gaps we should plan for?",
    "direction": "received",
    "timestamp": "Oct 1, 2023, 10:18 AM"
  },
  {
    "id": 8,
    "senderId": 3,
    "text": "I’ll coordinate with the product team and provide an updated roadmap by Friday. I’ll also work with marketing to ensure technical details are accurately represented in the campaign. If anyone has specific requirements, please send them my way.",
    "direction": "sent",
    "timestamp": "Oct 1, 2023, 10:21 AM"
  },
  {
    "id": 9,
    "senderId": 2,
    "text": "I’ll share a risk assessment report and proposed contingency plans by the end of the week. I’ll also update the team on supplier negotiations. If there are any concerns about logistics, please let me know so we can address them proactively.",
    "direction": "received",
    "timestamp": "Oct 1, 2023, 10:24 AM"
  },
  {
    "id": 10,
    "senderId": 5,
    "text": "I’ll draft the campaign outline and share it for feedback. Collaboration with tech and product teams will be essential for a successful launch. I’d also like to propose a brainstorming session for creative ideas next week.",
    "direction": "sent",
    "timestamp": "Oct 1, 2023, 10:27 AM"
  },
  {
    "id": 11,
    "senderId": 1,
    "text": "Let’s schedule a follow-up meeting next week to finalize the campaign and review the updated project timeline. Thank you, everyone, for your commitment and collaboration. Please send any additional agenda items to me by Thursday.",
    "direction": "received",
    "timestamp": "Oct 1, 2023, 10:30 AM"
  }
]
